#include "../include/structure.h"
#include "../include/list_structure.h"
#include "../include/arr_structure.h"
#include "../include/list_operations.h"
#include "../include/arr_operations.h"

/*
    Создать программу работы со стеком, выполняющую операции:
    - Добавление
    - Удаление
    - Вывод состояния стека

    Реализовать стек:
    - Массивом
    - Списком

    Все стандартные операции должны быть оформлены как подпрограммы.
    При реализации стека списком в вывод текущего состояния стека добавить
    просмотр адресов элементов стека и создать свой список или массив свободных
    обастей (адресов освобождаемых элементов) с выводом его на экран

    --- Распечатать убывающие серии последовательности целых чисел
    --- в обратном порядке
*/
int main()
{


    return ERROR_NONE;
}